Revit 2027 API
ParameterTypeId.StairsRailingTangentConnection Property
 "Tangent Joins"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StairsRailingTangentConnection { get; }
Public Shared ReadOnly Property StairsRailingTangentConnection As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StairsRailingTangentConnection {
	ForgeTypeId^ get ();
}
static member StairsRailingTangentConnection : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace